Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipni</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["dhfind:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }
    }

  # github_repository.this["dhfind"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + branches               = (known after apply)
      + default_branch         = "main"
      + delete_branch_on_merge = true
      + description            = "Service to find double hashed indexed records"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = true
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "dhfind"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "double-hashing",
          + "privacy",
          + "store",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # github_team_repository.this["admin:dhfind"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "dhfind"
      + team_id    = "7006912"
    }

  # github_team_repository.this["ci:dhfind"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "dhfind"
      + team_id    = "7006911"
    }

  # github_team_repository.this["contributors:dhfind"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "dhfind"
      + team_id    = "7006913"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->